# Eleman İslemleri

In [4]:
import numpy as np
import pandas as pd
s1 = np.random.randint(10,size = 5)
s2 = np.random.randint(10,size = 5)
s3 = np.random.randint(10,size = 5)

In [5]:
sozluk = {"var1":s1 ,"var2":s2, "var3": s3}

In [6]:
sozluk

{'var1': array([5, 5, 5, 6, 0]),
 'var2': array([1, 3, 3, 8, 3]),
 'var3': array([4, 9, 0, 0, 5])}

In [7]:
df = pd.DataFrame(sozluk)

In [8]:
df

   var1  var2  var3
0     5     1     4
1     5     3     9
2     5     3     0
3     6     8     0
4     0     3     5

In [9]:
df[0:1]

   var1  var2  var3
0     5     1     4

In [13]:
df.index = ["a","b","c","d","e"]

In [14]:
df

   var1  var2  var3
a     5     1     4
b     5     3     9
c     5     3     0
d     6     8     0
e     0     3     5

In [15]:
df["c":"e"]

   var1  var2  var3
c     5     3     0
d     6     8     0
e     0     3     5

In [16]:
#silme

In [17]:
df.drop("a",axis=0)

   var1  var2  var3
b     5     3     9
c     5     3     0
d     6     8     0
e     0     3     5

In [18]:
df #gerçekten silinmemiş

   var1  var2  var3
a     5     1     4
b     5     3     9
c     5     3     0
d     6     8     0
e     0     3     5

In [19]:
df.drop("a",axis= 0,inplace = True) #inplace kesin gider. silinir

In [20]:
df

   var1  var2  var3
b     5     3     9
c     5     3     0
d     6     8     0
e     0     3     5

In [21]:
#Fancy ile silme
l = ["c","e"]
df.drop(l,axis = 0)

   var1  var2  var3
b     5     3     9
d     6     8     0

In [22]:
df

   var1  var2  var3
b     5     3     9
c     5     3     0
d     6     8     0
e     0     3     5

In [23]:
"var1" in df

True

In [24]:
l = ["var1","var4","var2"]

In [25]:
for i in l:
    print(i in df)

True
False
True

In [27]:
df["var1"]

b    5
c    5
d    6
e    0
Name: var1, dtype: int32

In [28]:
df["var4"] = df["var1"] / df["var2"]

In [29]:
df

   var1  var2  var3      var4
b     5     3     9  1.666667
c     5     3     0  1.666667
d     6     8     0  0.750000
e     0     3     5  0.000000

In [30]:
#DEgisken silmek
df.drop("var4",axis = 1)

   var1  var2  var3
b     5     3     9
c     5     3     0
d     6     8     0
e     0     3     5

In [31]:
df.drop("var4",axis = 1,inplace = True)

In [32]:
df

   var1  var2  var3
b     5     3     9
c     5     3     0
d     6     8     0
e     0     3     5

In [33]:
l = ["var1","var2"]

In [34]:
df.drop(l,axis=1)

   var3
b     9
c     0
d     0
e     5